Revit 2027 API
FabricationPartRouteEnd.CreateFromCenterline Method
 Create fabrication routing end from centerline point on straight element.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FabricationPartRouteEnd CreateFromCenterline(
	Element element,
	XYZ ptAt
)
Public Shared Function CreateFromCenterline (
	element As Element,
	ptAt As XYZ
) As FabricationPartRouteEnd
public:
static FabricationPartRouteEnd^ CreateFromCenterline(
	Element^ element,
	XYZ^ ptAt
)
static member CreateFromCenterline :
        element : Element *
        ptAt : XYZ -> FabricationPartRouteEnd
Parameters
element Element
 The straight element that the centerline is on.
ptAt XYZ
 A point along the straight element where the fitting to be cut in should be positioned.
Return Value
FabricationPartRouteEnd
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationPartRouteEnd Class
Autodesk.Revit.DB.Fabrication Namespace